# SQL Challenges, Class Day 6

The following notebook includes 4 questions from the SQL challenges given in class as well as the table and normally distributed visualization for question 10. Details [here](https://docs.google.com/document/d/1BQJTwEZtaTSCl6a8pCJV4aFx2sbzJaJJ-5b62mnSlpY/edit).

In [8]:
import pandas as pd

### Which top 3 categories of crime are most likely to go unresolved in Mission District?
```mysql
SELECT COUNT(*) resolution, category FROM tutorial.sf_crime_incidents_cleandate 
WHERE resolution = 'NONE'
GROUP BY category, resolution
ORDER BY resolution DESC
LIMIT 3
```

In [9]:

query_1 = pd.read_csv('datasets/sql_challenges-top_3_crime_cat-6475ffb44a32-2018-01-27-07-29-39.csv')
query_1

   resolution       category
0        7582  LARCENY/THEFT
1        2377   NON-CRIMINAL
2        1379        ASSAULT

### Write a query that finds the top 5 tallest players, as well as their position, height, school, and the conference they belong to.

```mysql
SELECT full_school_name, position, height, teams.conference FROM benn.college_football_players players
JOIN benn.college_football_teams teams
ON players.full_school_name = teams.school_name
GROUP BY position, full_school_name, position, height, teams.conference
ORDER BY height DESC
LIMIT 5
```

In [10]:
query_2 = pd.read_csv('datasets/sql_challenges-top_5_height-35b056af87ff-2018-01-27-06-59-09 (1).csv')
query_2

  full_school_name position  height conference
0     North Dakota       OL    80.0    Big Sky
1     North Dakota       OL    78.0    Big Sky
2     North Dakota       TE    78.0    Big Sky
3     North Dakota       DL    77.0    Big Sky
4     North Dakota       OL    77.0    Big Sky

### Create a table that displays the average height of players at each position.
```mysql
SELECT avg(height), position FROM benn.college_football_players 
GROUP BY position
```

In [11]:
query_3= pd.read_csv('datasets/sql_challenges-avg_height-e59a1440aafb-2018-01-27-06-38-13.csv')
query_3

          avg position
0   72.322258       LB
1   70.583639       DB
2   70.862385        K
3   73.620588       QB
4   74.225914       DT
5   74.089286       NT
6   74.744102       DE
7   75.424460        G
8   75.322823       TE
9   74.894040        C
10  73.965105       DL
11  71.015521       FB
12  71.582575       WR
13  69.649168       RB
14  72.064240        S
15  72.447514        P
16  75.254706       OL
17  70.627081       CB
18  77.134185       OT
19  28.055556        ?
20  72.223058       LS

### Companies from which 10 cities have the  highest average acquisition amount?

```mysql
SELECT price_amount, company_city, company_name FROM tutorial.crunchbase_acquisitions 
WHERE price_amount != 0 AND company_city is NOT NULL
GROUP BY price_amount, company_city, company_name
ORDER BY price_amount DESC
LIMIT 10
```

In [12]:
query_4 = pd.read_csv('datasets/sql_challenges-top_10_acquistions-4dedc328ff50-2018-01-30-01-35-58.csv')
query_4

   price_amount         company_city           company_name
0  3.500000e+10        Overland Park  Nextel Communications
1  2.810000e+10          Little Rock                 Alltel
2  1.840000e+10            Charlotte   Goodrich Corporation
3  1.600000e+10   510 Lake Cook Road               Beam Inc
4  1.390000e+10                Plano                    EDS
5  1.370000e+10              Utrecht                  Ziggo
6  1.050000e+10  South San Francisco   Onyx Pharmaceuticals
7  1.020000e+10        San Francisco   Autonomy Corporation
8  1.000000e+10             New York     Paramount Pictures
9  9.400000e+09                Tokyo         Tokyo Electron

### For companies in SF with names that start with the letter ‘a’, what percentage of companies raise a funding total between between 25 and 30 million? Create a visualization that shows this on a graph of a normal distribution.

In [7]:
query_5= pd.read_csv('datasets/sql_challenges-sf_a_companies-0df8a524c950-2018-01-27-19-37-28.csv')
with pd.option_context('display.max_rows', None, 'display.max_columns', 3):
    print(query_5)

          company_name   company_city  raised_amount_usd
0             Aardvark  San Francisco           750000.0
1             Aardvark  San Francisco          5250000.0
2         Academia.edu  San Francisco          1600000.0
3         Academia.edu  San Francisco          4500000.0
4         Academia.edu  San Francisco         11100000.0
5   Acendi Interactive  San Francisco          2090000.0
6            Achievers  San Francisco          4700000.0
7            Achievers  San Francisco          5922326.0
8            Achievers  San Francisco         14000000.0
9            Achievers  San Francisco         24500000.0
10         ACT Biotech  San Francisco          6567000.0
11           Addvocate  San Francisco          2390000.0
12               Adeze  San Francisco          2500000.0
13               Adeze  San Francisco          3000000.0
14              AdGrok  San Francisco           470000.0
15           Ad Infuse  San Francisco           600000.0
16           Ad Infuse  San Francisco          5000000.0
17           Ad Infuse  San Francisco         12000000.0
18              Adioso  San Francisco            15000.0
19              Adioso  San Francisco            70000.0
20                Adku  San Francisco          1500000.0
21            AdRocket  San Francisco          1000000.0
22              AdRoll  San Francisco          4000000.0
23              AdRoll  San Francisco         15000000.0
24             AdStage  San Francisco           100000.0
25             AdStage  San Francisco          1400000.0
26  Adura Technologies  San Francisco          5000000.0
27  Adura Technologies  San Francisco          8500000.0
28  Adura Technologies  San Francisco         12000000.0
29            AdverCar  San Francisco          2000000.0
30       Advice Wallet  San Francisco            25000.0
31       Advice Wallet  San Francisco            70000.0
32       Advice Wallet  San Francisco           300000.0
33              Adynxx  San Francisco          2000000.0
34             AgileMD  San Francisco          2000000.0
35             AimWith  San Francisco             5000.0
36              Airbnb  San Francisco            20000.0
37              Airbnb  San Francisco           600000.0
38              Airbnb  San Francisco          6621000.0
39              Airbnb  San Francisco          7200000.0
40              Airbnb  San Francisco        112000000.0
41              Airbnb  San Francisco        200000000.0
42               AirPR  San Francisco          1000000.0
43       Airstone Labs  San Francisco          2511000.0
44              Aktana  San Francisco          1010000.0
45              Aktana  San Francisco          1050000.0
46              Aktana  San Francisco          2060000.0
47              Aktana  San Francisco          5000000.0
48               Aligo  San Francisco          7920000.0
49            AliveCor  San Francisco          3000000.0
50            AliveCor  San Francisco         10500000.0
51     AllBusiness.com  San Francisco         10000000.0
52     AllBusiness.com  San Francisco         12400000.0
53           AllTrails  San Francisco           250000.0
54           AllTrails  San Francisco           400000.0
55           AllTrails  San Francisco           990000.0
56           Allvoices  San Francisco            51068.0
57           Allvoices  San Francisco          4225500.0
58     Alphabet Energy  San Francisco          1000000.0
59     Alphabet Energy  San Francisco          2000000.0
60     Alphabet Energy  San Francisco         12000000.0
61     Alphabet Energy  San Francisco         16000000.0
62          Alt12 Apps  San Francisco          1260000.0
63           Alter Eco  San Francisco          3050000.0
64    Altius Education  San Francisco          8000000.0
65    Altius Education  San Francisco         18600000.0
66             Anaplan  San Francisco         11400000.0
67             Anaplan  San Francisco         33000000.0
68             Anapsis  San Francisco           100000.0
69           AngelList  San Francisco         24000000.0
70     Animated Speech  San Francisco           250000.0
71                Anki  San Francisco         50000000.0
72             AnyPerk  San Francisco          1400000.0
73      Apartment List  San Francisco         15000000.0
74              Apcera  San Francisco          2200000.0
75              Apcera  San Francisco          5000000.0
76              Apiary  San Francisco           120000.0
77              Apiary  San Francisco          1630000.0
78           Appbistro  San Francisco           600000.0
79           AppDirect  San Francisco          3250000.0
80           AppDirect  San Francisco          8500000.0
81           AppDirect  San Francisco          9000000.0
82         AppDynamics  San Francisco          5500000.0
83         AppDynamics  San Francisco         11000000.0
84         AppDynamics  San Francisco         20000000.0
85         AppDynamics  San Francisco         50000000.0
86           Appiphany  San Francisco           200000.0
87             Appirio  San Francisco          1100000.0
88             Appirio  San Francisco          5600000.0
89             Appirio  San Francisco         10000000.0
90             Appirio  San Francisco         60000000.0
91              AppJet  San Francisco           700000.0
92    Applied Identity  San Francisco         10000000.0
93    Applied Identity  San Francisco         11000000.0
94    Applied Identity  San Francisco         12000000.0
95             AppMesh  San Francisco          3000000.0
96             App.net  San Francisco          2500000.0
97          Apportable  San Francisco          2400000.0
98           AppRedeem  San Francisco           700000.0
99       Appstores.com  San Francisco           565000.0